Advanced_Cases/Cylinder/kwSST/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5e-5;

boundaryField
{
    inlet      
    {
        type            calculated;
	value		uniform 5e-5;
    }
    outlet      
    {
        type            calculated;
	value		uniform 5e-5;
    }   
    fixedWalls      
    {
        type            nutUSpaldingWallFunction;
	value		uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    topAndBottom
    {
        type            calculated;
	value		uniform 5e-5;
    }
}

// ************************************************************************* //
