Advanced_Cases/Cylinder/kwSST/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 405.00000000000006;

boundaryField
{
    inlet      
    {
        type            fixedValue;
        value		 uniform 405;
    }
    outlet      
    {
    	type            inletOutlet;
    	inletValue	uniform 405;
    	value		uniform 0;
    }   
    fixedWalls      
    {
        type            omegaWallFunction;
	value		uniform 0;
    }
    frontAndBack
    {
        type          	empty;
    }
    topAndBottom
    {
	type 		zeroGradient;
    }
}


// ************************************************************************* //
