Advanced_Cases/Cylinder/kwSST/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       19800;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       20000;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       20100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       20200;
    }
)

// ************************************************************************* //
