Advanced_Cases/Cylinder/kwSST/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
	(0 0 0)			//0
	(2 0 0)			//1
	(2.05 0.05 0)		//2
	(2.1 0 0)		//3
	(4.1 0 0)		//4
	(2.05 2.05 0)		//5
	(2.05 -0.05 0)		//6
	(2.05 -2.05 0)		//7
	(0 0 0)			//8
	(0 0 0)			//9
	(0 0 0.1)			//10
	(2 0 0.1)			//11
	(2.05 0.05 0.1)		//12
	(2.1 0 0.1)		//13
	(4.1 0 0.1)		//14
	(2.05 2.05 0.1)		//15
	(2.05 -0.05 0.1)		//16
	(2.05 -2.05 0.1)		//17

);

blocks          
(
    hex (0 1 2 5 10 11 12 15)     (50 50 1)   simpleGrading (0.0004 1 1)
    hex (5 2 3 4 15 12 13 14)     (50 50 1)   simpleGrading (0.0004 1 1)
    hex (4 3 6 7 14 13 16 17)     (50 50 1)  simpleGrading (0.0004 1 1)
    hex (7 6 1 0 17 16 11 10)   (50 50 1)  simpleGrading (0.0004 1 1)
);

edges           
(
arc 1 2 (2.0146446609406725 0.035355339059327376 0)
arc 2 3 (2.085355339059327 0.035355339059327376 0)
arc 3 6 (2.085355339059327 -0.035355339059327376 0)
arc 6 1 (2.0146446609406725 -0.035355339059327376 0)
arc 11 12 (2.0146446609406725 0.035355339059327376 0.1)
arc 12 13 (2.085355339059327 0.035355339059327376 0.1)
arc 13 16 (2.085355339059327 -0.035355339059327376 0.1)
arc 16 11 (2.0146446609406725 -0.035355339059327376 0.1)

arc 5 0 (0.6004310985675774 1.4495689014324222 0)
arc 4 5 (3.499568901432422 1.4495689014324222 0)
arc 7 4 (3.499568901432422 -1.4495689014324222 0)
arc 0 7 (0.6004310985675774 -1.4495689014324222 0)
arc 15 10 (0.6004310985675774 1.4495689014324222 0.1)
arc 14 15 (3.499568901432422 1.4495689014324222 0.1)
arc 17 14 (3.499568901432422 -1.4495689014324222 0.1)
arc 10 17 (0.6004310985675774 -1.4495689014324222 0.1)
 );

patches         
(
    wall fixedWalls	//Cylinder Walls
    (
        (11 1 2 12)
	(12 2 3 13)
	(13 3 6 16)
	(16 6 1 11)
    )
    patch inlet		// Inlet Faces	
    (
        (0 10 15 5)
	(10 0 7 17)
    )
    patch outlet	// Outlet Faces
    (
        (5 15 14 4)
	(4 14 17 7)
    )
    //patch topAndBottom	// Top & Bottom of grid
    //(
    //)
    empty frontAndBack	// Front & Back faces
    (
	(0 5 2 1)
	(2 5 4 3)
	(3 4 6 7)
	(0 1 6 7)
	(10 11 12 15)
	(15 12 13 14)
	(14 13 16 17)
	(17 16 11 10)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
